//(«аконы де ћоргана.) Ёти законы устанавливают, что выражение !(условие1 && условие2)
//логически эквивалентно выражению (!условие1 && !условие2). “ак же выражение 
// !(условие1 || условие2) логически эквивалетно выражению (!условие1 && !условие2).
//»спользуйте законы де ћоргана дл€ написани€ эквивалентного выражени€ дл€ каждого из
//следующих выражений, а затем напишите программу, показывающую, что исходное  и новое
//выражени€ в каждом случае €вл€ютс€ эквивалентными:
//a) !(x < 5) && !( y >= 7)
//b) !(a == b) || !(g != 5)
//c) !((x <= 8) && (y > 4))
//d) !((i > 4) || (j <=6))

#include <stdio.h>

int main()
{
	int x = 10;
	int y = 1;
	int a = 4;
	int b = 5;
	int g = 5;
	int i = 3;
	int j = 7;

	if( (!(x < 5) && !( y >= 7)) && !((x < 5) && ( y >= 7)) )
	{
		printf("a) !(x < 5) && !( y >= 7) == !((x < 5) && ( y >= 7))\n");
	}
	if( (!(a == b) || !(g != 5)) && (!(a == b) || (g != 5)) )
	{
		printf("b) !(a == b) || !(g != 5)) && (!!((a == b) || (g != 5))\n");
	}
	if( (!((x <= 8) && (y > 4))) && (!(x <= 8) && !(y > 4)) )
	{
		printf("c) !((x <= 8) && (y > 4))) && (!(x <= 8) && !(y > 4))\n");
	}
	if( (!((i > 4) || (j <=6))) && (!(i > 4) && !(j <=6)) )
	{
		printf("d) !((i > 4) || (j <=6))) && (!(i > 4) || !(j <=6))\n");
	}

	return 0;
}