//Ќапишите программу, котора€ по отдельности выводит один под другим следующие рисунки
//ƒл€ генерации рисунков используйте цикл for. ¬се (*) должны выводитьс€ единственным
//оператором printf в виде printf("*"); (это вызывает вывод звездочек р€дом друг с
//другом). ѕодсказка: дл€ последних двух рисунков необходимо, чтобы кажда€ строка
//начиналась с соответствующего числа пробелов.
//(A)			(B)			(C)			(D)
//*				**********	**********	         *
//**			*********	 *********	        **
//***			********	  ********	       ***
//****			*******		   *******	      ****
//*****			******		    ******	     *****
//******		*****		     *****	    ******
//*******		****		      ****	   *******
//********		***			       ***	  ********
//*********		**			        **	 *********
//**********	*					 *	**********

#include <stdio.h>

int main()
{
	int x = 1;
	int y;

	for(; x < 11; x++)
	{
		for(y = 1; y <= x; y++)
		{
			printf("*");
		}
		printf("\n");
	}
	printf("\n");
	for(x = 10; x > 0; x--)
	{
		for(y = 1; y <= x; y++)
		{
			printf("*");
		}
		printf("\n");
	}
	printf("\n");
	for(x = 10; x > 0; x--)
	{
		for(y = (10 - x); 0 < y; y--)
		{
			printf(" ");
		}
		for(y = 1; y <= x; y++)
		{
			printf("*");
		}
		printf("\n");
	}
	for(; x < 11; x++)
	{
		for(y = (10 - x); 0 < y; y--)
		{
			printf(" ");
		}
		for(y = 1; y <= x; y++)
		{
			printf("*");
		}
		printf("\n");
	}
	printf("\n");

	return 0;
}